## software_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 4 to change, 4 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.dependencytrack_api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dependencytrack_api_policies"  {
      ~ id      = "2875954831" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "elasticfilesystem:DescribeMountTargets",
                          - "elasticfilesystem:ClientWrite",
                          - "elasticfilesystem:ClientMount",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:elasticfilesystem:ca-central-1:794722365809:file-system/fs-00d2fbd255781e5ec"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.dependencytrack_api_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "dependencytrack_api_container_definition"  {
      ~ id       = "1f385eea2921a50ad2b949ba993378b4d87a7566553a65ddb74071fc25ffb08e" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - cpu              = 4096
                  - environment      = [
                      - {
                          - name  = "ALPINE_DATABASE_MODE"
                          - value = "external"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_URL"
                          - value = "jdbc:postgresql://dependency-track-proxy.proxy-cjgksqbmhiov.ca-central-1.rds.amazonaws.com:5432/dtrack"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_DRIVER"
                          - value = "org.postgresql.Driver"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_DRIVER_PATH"
                          - value = "/extlib/postgresql-42.2.5.jar"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_MAX_SIZE"
                          - value = "20"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_MIN_IDLE"
                          - value = "10"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_IDLE_TIMEOUT"
                          - value = "300000"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_MAX_LIFETIME"
                          - value = "600000"
                        },
                      - {
                          - name  = "ALPINE_CORS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_ORIGIN"
                          - value = "*"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_METHODS"
                          - value = "GET, POST, PUT, DELETE, OPTIONS"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_HEADERS"
                          - value = "Origin, Content-Type, Authorization, X-Requested-With, Content-Length, Accept, Origin, X-Api-Key, X-Total-Count, *"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_CREDENTIALS"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_CORS_MAX_AGE"
                          - value = "3600"
                        },
                    ]
                  - essential        = true
                  - image            = "dependencytrack/apiserver:4.6.1@sha256:54a44aab50129bcf0ae3dbeea2508870b48af132969a6929f0a75c772db7079b"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/dependencytrack_api"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "dependencytrack_api-task"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/data"
                          - readOnly      = false
                          - sourceVolume  = "dependencytrack_api"
                        },
                    ]
                  - name             = "dependencytrack_api"
                  - portMappings     = [
                      - {
                          - ContainerPort = 8080
                          - Protocol      = "tcp"
                          - hostPort      = 8080
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ALPINE_DATABASE_USERNAME"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user"
                        },
                      - {
                          - name      = "ALPINE_DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_service.dependencytrack_api will be updated in-place
  ~ resource "aws_ecs_service" "dependencytrack_api" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/software_asset_tracking/dependencytrack_api"
        name                               = "dependencytrack_api"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_api:19" -> (known after apply)
        # (15 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.dependencytrack_api must be replaced
-/+ resource "aws_ecs_task_definition" "dependencytrack_api" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_api:19" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 4096
                  - environment      = [
                      - {
                          - name  = "ALPINE_CORS_ALLOW_CREDENTIALS"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_HEADERS"
                          - value = "Origin, Content-Type, Authorization, X-Requested-With, Content-Length, Accept, Origin, X-Api-Key, X-Total-Count, *"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_METHODS"
                          - value = "GET, POST, PUT, DELETE, OPTIONS"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_ORIGIN"
                          - value = "*"
                        },
                      - {
                          - name  = "ALPINE_CORS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_CORS_MAX_AGE"
                          - value = "3600"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_DRIVER"
                          - value = "org.postgresql.Driver"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_DRIVER_PATH"
                          - value = "/extlib/postgresql-42.2.5.jar"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_MODE"
                          - value = "external"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_IDLE_TIMEOUT"
                          - value = "300000"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_MAX_LIFETIME"
                          - value = "600000"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_MAX_SIZE"
                          - value = "20"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_MIN_IDLE"
                          - value = "10"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_URL"
                          - value = "jdbc:postgresql://dependency-track-proxy.proxy-cjgksqbmhiov.ca-central-1.rds.amazonaws.com:5432/dtrack"
                        },
                    ]
                  - essential        = true
                  - image            = "dependencytrack/apiserver:4.6.1@sha256:54a44aab50129bcf0ae3dbeea2508870b48af132969a6929f0a75c772db7079b"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/dependencytrack_api"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "dependencytrack_api-task"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/data"
                          - readOnly      = false
                          - sourceVolume  = "dependencytrack_api"
                        },
                    ]
                  - name             = "dependencytrack_api"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ALPINE_DATABASE_USERNAME"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user"
                        },
                      - {
                          - name      = "ALPINE_DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "dependencytrack_api" -> (known after apply)
      ~ revision                 = 19 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - volume {
          - name = "dependencytrack_api" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-00d2fbd255781e5ec" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null

              - authorization_config {
                  - access_point_id = "fsap-097132859e0c22c68" -> null
                  - iam             = "DISABLED" -> null
                }
            }
        }
      + volume {
          + name = "dependencytrack_api"

          + efs_volume_configuration {
              + file_system_id     = "fs-00d2fbd255781e5ec"
              + root_directory     = "/"
              + transit_encryption = "ENABLED"

              + authorization_config {
                  + access_point_id = "fsap-097132859e0c22c68"
                  + iam             = "DISABLED"
                }
            }
        }
    }

  # aws_iam_policy.dependencytrack_api_policies will be updated in-place
  ~ resource "aws_iam_policy" "dependencytrack_api_policies" {
        id        = "arn:aws:iam::794722365809:policy/DependencytrackAPIContainerExecutionPolicies"
        name      = "DependencytrackAPIContainerExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "elasticfilesystem:DescribeMountTargets",
                          - "elasticfilesystem:ClientWrite",
                          - "elasticfilesystem:ClientMount",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:elasticfilesystem:ca-central-1:794722365809:file-system/fs-00d2fbd255781e5ec"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.dependencytrack_db_password will be updated in-place
  ~ resource "aws_ssm_parameter" "dependencytrack_db_password" {
        id              = "/dependencytrack/dependencytrack_db_password"
      + insecure_value  = (known after apply)
        name            = "/dependencytrack/dependencytrack_db_password"
        tags            = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 11 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # random_password.dependencytrack_db_password["2022-12"] will be destroyed
  # (because key ["2022-12"] is not in for_each map)
  - resource "random_password" "dependencytrack_db_password" {
      - bcrypt_hash = (sensitive value)
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 1 -> null
      - min_numeric = 1 -> null
      - min_special = 0 -> null
      - min_upper   = 1 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.dependencytrack_db_password["2023-01"] will be created
  + resource "random_password" "dependencytrack_db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 0
      + min_upper   = 1
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.dependencytrack_db.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
        id                                  = "dependency-track-cluster"
      ~ master_password                     = (sensitive value)
        tags                                = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "dependency-track-cluster"
            "Terraform"  = "true"
        }
        # (43 unchanged attributes hidden)
    }

  # module.dependencytrack_db.aws_secretsmanager_secret_version.connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-vhjwtm-iS90d1" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-vhjwtm-iS90d1|568B2939-9762-4240-A38D-2D953765B7CB" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "568B2939-9762-4240-A38D-2D953765B7CB" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dependencytrack_db.aws_secretsmanager_secret_version.proxy_connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-vhjwtm-proxy-connection-string-YGauyY" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-vhjwtm-proxy-connection-string-YGauyY|16A80213-098E-4D35-878B-27FA45DF5BC6" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "16A80213-098E-4D35-878B-27FA45DF5BC6" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 4 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
